const text = `
🟢(اليوم الأحد)2026/08/16{اخر تحديث}
⏰12:00

💵الدولار=9.10دينار🔺🔥
💰دينار.ليبي=0.345 دينار.تونسي
💰دينار.ليبي=5.50 جنيه.مصري
🪙أونصة الفضة عالمياً= 64.7$
`;

// Added the prefix capture to TND
const tndRegexStr = "(?:((?!(?:100|1)\\s*(?:=|ب|دينار|ليبي|\\-))\\d{1,3}(?:[\\.,]\\d{1,4})?)[^\\d]{0,20})?(?:TND|tnd|تونسي|تونس(?![ا-ي])|🇹🇳)[^\\d]{0,40}?(?:100|1)?\\s*(?:=|ب|\\-)?\\s*(?<!\\d)((?!(?:100|1)\\s*(?:=|ب|دينار|ليبي|\\-))\\d{1,3}(?:[\\.,]\\d{1,4})?)(?:\\s+(?:بيع|شراء)?[^\\d]{0,30}(?<!\\d)((?!(?:100|1)\\s*(?:=|ب|دينار|ليبي|\\-))\\d{1,3}(?:[\\.,]\\d{1,4})?))?";
const tndRegex = new RegExp(tndRegexStr, "i");

const matchTND = text.match(tndRegex);
console.log("TND:", matchTND[1], matchTND[2], matchTND[3]);

// Added the prefix capture to EGP
const egpRegexStr = "(?:((?!(?:100|1)\\s*(?:=|ب|دينار|ليبي|\\-))\\d{1,3}(?:[\\.,]\\d{1,4})?)[^\\d]{0,20})?(?:EGP|egp|مصري|مصر(?![ا-ي])|🇪🇬)[^\\d]{0,40}?(?:100|1)?\\s*(?:=|ب|\\-)?\\s*(?<!\\d)((?!(?:100|1)\\s*(?:=|ب|دينار|ليبي|\\-))\\d{1,3}(?:[\\.,]\\d{1,4})?)(?:\\s+(?:بيع|شراء)?[^\\d]{0,30}(?<!\\d)((?!(?:100|1)\\s*(?:=|ب|دينار|ليبي|\\-))\\d{1,3}(?:[\\.,]\\d{1,4})?))?";
const egpRegex = new RegExp(egpRegexStr, "i");

const matchEGP = text.match(egpRegex);
console.log("EGP:", matchEGP[1], matchEGP[2], matchEGP[3]);

